# Importing Libraries

In [1]:
# Import libraries 
import pandas as pd 
import numpy as np 
import os

# Importing Data

In [2]:
#creating a variable for original data path 
path = r'/Users/scarlettgrim/Python Projects/01-2024 Instacart Basket Analysis'

In [3]:
#using path to import products.csv
df_prods = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'products.csv'), index_col = False)

In [4]:
#using path to import orders_wrangled.csv
df_ords = pd.read_csv(os.path.join(path, 'Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# Data Consistency Checks

In [43]:
#using describe to look at df_ords 
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_from_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

# Practicing mixed type data columns

In [6]:
#create a dataframe 
df_test = pd.DataFrame()

In [7]:
#create a mixed type column 
df_test['mix'] = ['a', 'b', '1', True]

In [8]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [9]:
#checking for mixed data types 

for col in df_test.columns.tolist(): 
    weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_test[weird]) > 0:
        print(col)

mix

In [10]:
#changing data type to a string 
df_test['mix'] = df_test['mix'].astype('str')

# Missing values in df_prods

In [11]:
#searching for null values in df_prods 
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [12]:
#subset of null values 
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [13]:
#looking at df_nan subset 
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [14]:
#checking rows before and after removal in df_prods 
df_prods.shape

(49693, 5)

In [15]:
#subset without missing data 
df_prods_clean = df_prods[df_prods['product_name'].isnull () == False]

In [16]:
#checking number of rows decreased 
df_prods_clean.shape

(49677, 5)

# Duplicates for df_prods

In [17]:
#checking for duplicates in df_prods_clean 
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [18]:
#looking at the duplicates found 
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [19]:
#checking amount of rows
df_prods_clean.shape

(49677, 5)

In [20]:
#removing duplicates by creating new subset 
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [21]:
df_prods_clean_no_dups.shape

(49672, 5)

# Exporting df_prods - checked

In [22]:
#exporting df_prods_clean_no_dups 
df_prods_clean_no_dups.to_csv(os.path.join(path, 'Data', 'Prepared Data', 'products_checked.csv'))

# Task 4.5

# Question 2 - Checking Df_ords using describe

In [23]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_from_last_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [24]:
#checking row count
df_ords.shape

(3421083, 8)

In [25]:
#order number has a minimum of 1 and a max of 100 given the number of rows this should be investigatedhttp://localhost:8888/notebooks/Python%20Projects/01-2024%20Instacart%20Basket%20Analysis/Scripts%20/4.5%20Data%20Consistency%20Checks%20.ipynb#

# Question 3 - mixed data types in df_ords

In [26]:
#checking for mixed data types 

for col in df_ords.columns.tolist(): 
    weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_ords[weird]) > 0:
        print(col)

In [27]:
# no mixed data types were found

# Question 5 - missing values in df_ords

In [28]:
#checking df_ords for missing values 
df_ords.isnull().sum()

Unnamed: 0                   0
order_id                     0
user_id                      0
eval_set                     0
order_number                 0
orders_day_of_week           0
order_hour_of_day            0
days_from_last_order    206209
dtype: int64

In [29]:
#I found that there are 206,209 null values for days since missing order. 
#I am wondering if this is from people who are placing their first order and have 
#no days since last order data. 
#I don't want to delete this dat since it is relevant. 
#The plan is to start by seeing if order frequency matches the number of day_since_last_order
#If these numbers match i need to create a new columnt hat flags new orders - True/False

# Question 6 - addressing missing values

In [30]:
#creating a subset for missing values in df_ords
df_ords_nan = df_ords[df_ords['days_from_last_order'].isnull() == True]

In [31]:
#checking if order number count matches missing value count 
df_ords_nan['order_number'].value_counts()

order_number
1    206209
Name: count, dtype: int64

In [32]:
#visualizing data to see order_number for null values
df_ords_nan

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_from_last_order
0,0,2539329,1,prior,1,2,8,NaN
11,11,2168274,2,prior,1,2,11,NaN
26,26,1374495,3,prior,1,1,14,NaN
39,39,3343014,4,prior,1,6,11,NaN
45,45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,prior,1,4,12,NaN
3420934,3420934,3189322,206206,prior,1,3,18,NaN
3421002,3421002,2166133,206207,prior,1,6,19,NaN
3421019,3421019,2227043,206208,prior,1,1,15,NaN
3421069,3421069,3154581,206209,prior,1,3,11,NaN

In [33]:
#The number of missing values matches the number of orders meaning that the missing data 
#represents people who are placing their first order

In [34]:
#create a function that determines if an order is the first order 
def first_order(row):
        if row ['order_number'] == 1: 
            return True 
        else: 
             return False

In [35]:
#checking dataframe 
df_ords.apply(lambda row: first_order(row), axis = 1)

0           True
1          False
2          False
3          False
4          False
           ...
3421078    False
3421079    False
3421080    False
3421081    False
3421082    False
Length: 3421083, dtype: bool

In [36]:
#I chose to add a column since missing values are of value and useful.

# Question 7 - checking for duplicates

In [37]:
#checking for duplicates in df_ords
df_dups = df_ords[df_ords.duplicated()]

In [38]:
#looking at duplicates in df_ords through df_dups
df_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, eval_set, order_number, orders_day_of_week, order_hour_of_day, days_from_last_order]
Index: []

In [39]:
#checking shape of df_dups 
df_dups.shape

(0, 8)

In [40]:
#No duplicates found!

# Question 9 - Export df_ords - checked

In [41]:
#exporting df_ords
df_ords.to_csv(os.path.join(path, 'Data', 'Prepared Data', 'orders_checked.csv'))

In [42]:
#df_prods already exported